# CreateLineAttributePopup

## Description
Create a dialog control that displays both line style and line weight choices available in the current document.

```pascal
PROCEDURE CreateLineAttributePopup(
				dialogID : LONGINT;
				itemID   : LONGINT);
```

```python

def vs.CreateLineAttributePopup(dialogID, itemID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|itemID|LONGINT||

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern